1m3_4mm_wall_H2_test_78/0.orig/air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0; // mass fraction

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    front
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    back
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    bottom_wall
    {
        type            zeroGradient;
    }
    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    nozzle_4mm_3mm_m
    {
        type            zeroGradient;
    }
    nozzle
    {
        type            fixedValue;
        value           uniform 0.0; // No air at inlet
    }
    box_shell_m
    {
        type            zeroGradient;
    }
}
// ************************************************************************* //
