1m3_4mm_wall_H2_test_78/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 3.02e-9; //updated new value

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField; //placeholder
    }
    front
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField; //placeholder
    }
    back
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField; //placeholder
    }
    bottom_wall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField; //placeholder
    }
    nozzle_4mm_3mm_m
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    nozzle
    {
        // Auto-scales with instantaneous k — consistent with U/k ramp.
        // ε = Cμ^(3/4)*k^(3/2)/L, L = 0.07×D = 0.07×4mm = 2.8e-4 m.
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    2.8e-4;
        value           uniform 2.76e-6;  //place holder
    }
    box_shell_m
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}
// ************************************************************************* //
